seryi2035/stm32001/021/main.c
  /* pass through message buffer */
  while (buffer_length--) {
      i = crc_hi ^ *buffer++; /* calculate the CRC  */
      crc_hi = crc_lo ^ table_crc_hi[i];
      crc_lo = table_crc_lo[i];
    }

  return (crc_hi << 8 | crc_lo);
}
static void             init_crc16_tab( void );

static u8               crc_tab16_init          = 0;
static uint16_t         crc_tab16[256];
uint16_t crc_modbus(u8 *input_str, u8 num_bytes ) {
  uint16_t crc;
  uint16_t tmp;
  uint16_t short_c;
  u8 *ptr;
  u8 a;
  if ( ! crc_tab16_init ) init_crc16_tab();
  crc = 0xFFFF;
  ptr = input_str;

  if ( ptr != 0 ) for (a=0; a<num_bytes; a++) {

      short_c = 0x00ff & (uint16_t) *ptr;
      tmp     =  crc       ^ short_c;
      crc     = (crc >> 8) ^ crc_tab16[ tmp & 0xff ];

      ptr++;
    }

  return crc;

}
void init_crc16_tab( void ) {

	uint16_t i;
	uint16_t j;
	uint16_t crc;
	uint16_t c;

	for (i=0; i<256; i++) {

		crc = 0;
		c   = i;

		for (j=0; j<8; j++) {

			if ( (crc ^ c) & 0x0001 ) crc = ( crc >> 1 ) ^ 0xA001;
			else                      crc =   crc >> 1;

			c = c >> 1;
		}

		crc_tab16[i] = crc;
	}

	crc_tab16_init = 1;

}

void TIM2_init(void) {
  TIM_TimeBaseInitTypeDef TIMER_InitStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
  TIM_TimeBaseStructInit(&TIMER_InitStructure);

  TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIMER_InitStructure.TIM_Prescaler = 36000;
  TIMER_InitStructure.TIM_Period = 49999;
  TIM_TimeBaseInit(TIM2, &TIMER_InitStructure);
  TIM_Cmd(TIM2, ENABLE);

  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  // ñ÷èòàåì îäèí ðàç
  TIM_SelectOnePulseMode(TIM2, TIM_OPMode_Single);
}
void TIM2_IRQHandler(void) {
  if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)   {
      TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
      //TimeSec++;
    }
  /*extern volatile uint8_t f_timer_2_end;

  TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
  TIM2->SR &= ~TIM_SR_UIF;
  f_timer_2_end = 1;

  TIM_Cmd(TIM2, DISABLE);
  TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);*/
}
void delay_us(uint32_t n_usec) {
  TIM4->CNT = 0;
  while (TIM4->CNT < n_usec);
  /*f_timer_2_end = 0;

  TIM2->PSC = 72 - 1;
  TIM2->ARR = (uint16_t)( n_usec);
  TIM_Cmd(TIM2, ENABLE);

  // äëÿ òîãî ÷òîáû óñòàíîâèëñÿ PSC
  TIM2->EGR |= TIM_EGR_UG;
  TIM2->SR &= ~TIM_SR_UIF;

  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  TIM_Cmd(TIM2, ENABLE);

  while(f_timer_2_end == 0);*/
}
void delay_ms(uint32_t n_msec) {
  TIM2->CNT = 0;
  while (TIM2->CNT < (2 * n_msec)){}
  /*f_timer_2_end = 0;

  TIM2->PSC = 36000 - 1;
  TIM2->ARR = (uint16_t)(2 * n_msec);
  // äëÿ òîãî ÷òîáû óñòàíîâèëñÿ PSC
  TIM2->EGR |= TIM_EGR_UG;
  TIM2->SR &= ~TIM_SR_UIF;
  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  TIM_Cmd(TIM2, ENABLE);
  while(f_timer_2_end == 0);*/
}

void TIM4_init(void) {
  TIM_TimeBaseInitTypeDef TIM_TimBaseStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
  //Initialise TIMER4
  TIM_TimBaseStructure.TIM_Period = 50000;
  TIM_TimBaseStructure.TIM_Prescaler = 72;
  TIM_TimBaseStructure.TIM_ClockDivision = 0;
  TIM_TimBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM4, &TIM_TimBaseStructure);
  TIM_Cmd(TIM4, ENABLE);

  // NVIC Configuration
  // Enable the TIM4_IRQn Interrupt
  NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  //и так есть основной void TIM2_init(void);
}
void TIM4_IRQHandler(void) {
  if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)
    {
      TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
      //TimeSec++;
    }
}

void TIM3_init(void) {
  TIM_TimeBaseInitTypeDef TIMER_InitStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
  //TIM_TimeBaseStructInit(&TIMER_InitStructure);

  TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIMER_InitStructure.TIM_Prescaler = 72;
  TIMER_InitStructure.TIM_Period = 1000;
  TIMER_InitStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseInit(TIM3, &TIMER_InitStructure);
  TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
  TIM_Cmd(TIM3, ENABLE);

  NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  // ñ÷èòàåì îäèí ðàç
  //TIM_SelectOnePulseMode(TIM3, TIM_OPMode_Single);
}
void TIM3_IRQHandler(void) {
  if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)   {
      TIM_ClearITPendingBit(TIM3, TIM_IT_Update);//очищаем прерывания
      //если наш таймер больше уставки задержки и есть символы то есть gap -перерыв в посылке
      //и можно ее обрабатывать
      /*if (TIM3->CNT > 1000) {
          uart1.rxtimer++;
          TIM3->CNT = 0;
        }
*/
      uart1.rxtimer++;
      if((uart1.rxtimer > uart1.delay)&(uart1.rxcnt > 1)) {
          uart1.rxgap=1;
        }
      else {
          uart1.rxgap=0;
        }
    }
}
